#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/vishnukap_learning/s3-website/runs/run-5M9VXEo5myod3TH4

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:805586991204:certificate/88f06708-4f66-4a62-b348-b98d782cc35c]
aws_acm_certificate_validation.cert: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_s3_bucket.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_website_configuration.s3_static_website: Refreshing state... [id=www.visham.org]
aws_s3_bucket_policy.allow_access: Refreshing state... [id=www.visham.org]
aws_s3_object.object["0"]: Refreshing state... [id=images/favicon.png]
aws_s3_bucket_ownership_controls.s3_static_website_object_ownership: Refreshing state... [id=www.visham.org]
aws_s3_bucket_public_access_block.s3_static_website_pa_block: Refreshing state... [id=www.visham.org]
aws_s3_bucket_acl.s3_static_website_acl: Refreshing state... [id=www.visham.org,public-read]
aws_cloudfront_distribution.cdn: Refreshing state... [id=E17YUM5QUJCVXF]
aws_route53_record.www: Refreshing state... [id=Z02024842F73WIP3EA0PB_www.visham.org_A]
aws_route53_record.dns: Refreshing state... [id=Z02024842F73WIP3EA0PB_visham.org_A]
aws_s3_object.object["0"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.files["index.html"] will be created
  + resource "aws_s3_object" "files" {
      + acl                    = "public-read"
      + bucket                 = "www.visham.org"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "49950a553e80f5a9da73b3c85939fff2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "src/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @roguecomp, Action: `pull_request`*